import std;

// @Trecer1
void number_to_words()
{
    std::println("8. Дано целое число в диапазоне 100-999. Вывести строку-описание.");

    int n = 0;
    std::print("Введите число (100-999): ");
    std::cin >> n;

    std::string hundreds[] = {"", "сто", "двести", "триста", "четыреста", "пятьсот", "шестьсот", "семьсот", "восемьсот", "девятьсот"};
    std::string tens[] = {"", "", "двадцать", "тридцать", "сорок", "пятьдесят", "шестьдесят", "семьдесят", "восемьдесят", "девяносто"};
    std::string units[] = {"", "один", "два", "три", "четыре", "пять", "шесть", "семь", "восемь", "девять"};
    std::string teens[] = {"десять", "одиннадцать", "двенадцать", "тринадцать", "четырнадцать", "пятнадцать", "шестнадцать", "семнадцать", "восемнадцать", "девятнадцать"};

    int h = n / 100;
    int t = (n / 10) % 10;
    int u = n % 10;

    std::println("{}", hundreds[h]);

    if (t == 1)
    {
        std::print(" {}", teens[u]);
    }
    else
    {
        if (t > 1)
        {
            std::print(" {}", tens[t]);
        }
        if (u > 0)
        {
            std::print(" {}", units[u]);
        }
    }
}

int main()
{
    number_to_words();

    return 0;
}